Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: The @ symbol and the difference between the round and curly braces will be explained momentarily.
ko: @ 기호와 소괄호와 중괄호 사이의 차이는 곧 설명할 것입니다.

source: The Option type provides a way of representing partial functions.
ko: Option 형은 부분 함수를 표현하는 한 방법을 제공합니다.

source: The local modifier tells the simplifier to use these rules in the current file (or section or namespace, as the case may be).
ko: local 수정자는 단순화기에게 현재 파일(아마 경우에 따라 섹션, 이름공간) 속 이 규칙을 사용하라고 말합니다.

source: The match interprets p as a pair, Prod.mk a b.
ko: match는 p를 쌍으로서 해석합니다. Prod.mk a b

source: The simp tactic also recognizes the ←t syntax that rewrite does.
ko: rewrite가 그런 것처럼 simp 전략도 ←t 문법을 인식할 수 있습니다.

source: The constructor tactic applies the unique constructor for conjunction, And.intro.
ko: constructor 전략은 결합자 And.intro에 대한 단일 생성자를 적용합니다.

source: The #check command asks Lean to report their types; in Lean, auxiliary commands that query the system for information typically begin with the hash (#) symbol.
ko: #check 명령은 린에게 그것의 유형을 보고하도록 요청합니다. 린에서 시스템에게 정보를 불러오는 보조 명령은 주로 해시(#) 기호로 시작합니다.

source: The rewrite tactic will be discussed below.
ko: rewrite전략은 아래에서 더 논의할 것 입니다.

source: The #eval command asks Lean to evaluate the given expression.
ko: #eval 명령은 린에게 제시된 표현의 값을 평가하도록 요청합니다.

source: The let construct is a stronger means of abbreviation, and there are expressions of the form let a := t1; t2 that cannot be expressed as (fun a => t2) t1.
ko: let 생성은 약어의 의미로 더 강합니다. 그리고 let a := t1; t2 형태의 표현식은 (fun a => t2) t1같이 표현될 수 없는 식이 있습니다.

source: The Calculus of Constructions therefore identifies dependent arrow types with forall-expressions in this way.
ko: 그러므로 직관주의 계산법은 의존 화살표 유형을 이처럼 모든-표현식으로 바라봅니다.

source: The Existential Quantifier
ko: 존재 한정기호

source: The Lean standard library contains many instances of inductive types (e.g., Nat, Prod, List), and even the logical connectives are defined using inductive types.
ko: 린 표준 라이브러리는 귀납형의 만은 개체(예 Nat, Prod, List)들을 담고 있습니다. 그리고 심지어 논리 결합자도 귀납형을 사용해 정의됩니다.

source: The Lean standard library contains the definition inferInstance.
ko: 린 표준 라이브러리는 inferInstance 정의를 포함합니다.

source: The Universal Quantifier
ko: 전칭 한정기호

source: The above snippet show three navigation commands:
ko: 위의 자투리는 세 가지 탐색 명령을 보여줍니다.

source: The actual Lean implementation defines homogeneous and heterogeneous classes for arithmetical operators.
ko: 실제 린에서 구현은 산술 연산자에 대한 동형과 이형 클래스를 정의합니다.

source: The advantage is that we can simply write trans_r hab hbc as a proof of r a c.
ko: 이것의 장점은 우리가 간단히 trans_r hab hbc을 r a c의 증명으로 쓸 수 있다는 겁니다.

source: The alternatives for each constructor don't need to be solved in the order the constructors were declared.
ko: 각 생성자에 대한 대안은 성성자가 선언된 순서대로 풀려야 할 필요는 없습니다.

source: The analogy to the logical connectives should not come as a surprise; as we will see below, they, too, are examples of inductive type constructions.
ko: 논리 연결사와 유사점은 놀라움으로 오지 말아야 합니다. 우리가 아래에서 보듯이 그들도 귀납형 생성의 예제입니다.

source: The appearances of constructors prompt case splits, with the arguments to the constructors represented by the given variables.
ko: 생성자의 출현은 제시된 변수로 표현된 생성자에 대한 인수로 경우를 신속히 나눕니다.

source: The arbitrary fact, q, that follows from falsity is an implicit argument in False.elim and is inferred automatically.
ko: q가 어떤 거짓 명제로부터 나온다는 사실은 False.elim에 대한 암시적 인수이며 자동적으로 추론됩니다.

source: The argument motive is used to specify the type of the object you want to construct, and it is a function because it may depend on the pair.
ko: 인자 motive는 여러분이 생성하기 원하는 대상의 유형을 명시하는데 사용됩니다. 그리고 이것은 쌍에 의존할 수 있기에 함수입니다.

source: The argument {n : Nat} appear after the colon, because it cannot be held fixed throughout the definition.
ko: 인수{n : Nat} 은 콜론 뒤에 나타납니다. 왜냐하면 이것은 정의 전체에 대해 고정될 수 없기 때문입니다.

source: The argument α : Type is a parameter and occurs before the colon to indicate it does not participate in the pattern matching.
ko: 인수 α : Type은 매개변수이고 패턴 매칭에 참여하지 않음을 지칭하는 콜론 앞에 있습니다.

source: The attribute can also be applied any time after the theorem is declared:
ko: 이 특성은 정리가 선언된 이후 언제든지 적용될 수 있습니다.

source: The automatically generated definitions for indexed families are far from straightforward.
ko: 인덱스된 군을 위한 자동적으로 생성된 정의는 직관과는 거리가 멉니다.

source: The classical axioms also give you access to additional patterns of proof that can be justified by appeal to em.
ko: 고전적 공리도 여러분에게 em에 호소하여 정당화될 수 있는 추가적인 증명 패턴의 접근을 줍니다.

source: The collection is interrupted by nested parentheses.
ko: 모음은 중첩된 괄호에 의해 중단됩니다.

source: The combinator focus t ensures that t only effects the current goal, temporarily hiding the others from the scope.
ko: 결합자 focus t은 일시적으로 범위로부터 다른 것들을 숨겨 t가 오직 현재 목표에만 영향을 끼침을 보장합니다.

source: The command namespace foo causes foo to be prepended to the name of each definition and theorem until end foo is encountered.
ko: namespace foo 명령은 end foo와 마추치기 전까지 foo가 각 정의와 정리의 이름에 앞에 붙게 합니다.

source: The command open foo then creates temporary aliases to definitions and theorems that begin with prefix foo.
ko: open foo 명령은 접두사 foo로 시작하는 정의와 정리에 일시적인 별명으로 만듭니다.

source: The command open List allows you to use the shorter names:
ko: open List 명령은 여러분이 더 짧은 이름을 사용할 수 있게 합니다.

source: The command set_option pp.all true carries out these settings all at once, whereas set_option pp.all false reverts to the previous values.
ko: set_option pp.all true 명령은 이 설정을 한번에 수행합니다. 반면 set_option pp.all false은 이전의 값으로 되돌립니다.

source: The connective False has a single elimination rule, False.elim, which expresses the fact that anything follows from a contradiction.
ko: 연결사 False은 하나의 제거 규칙 False.elim을 갖습니다. 이것은 모순으로부터 어떤 것이든 도출된다는 사실을 표현합니다.

source: The constructors, even_zero, even_succ, and odd_succ provide positive means for showing that a number is even or odd.
ko: 생성자 even_zero, even_succ과 odd_succ은 수가 짝수인지 홀수인지 보이는데 긍정적인 수단을 제공한다.

source: The course-of-values recursion is implemented by Nat.brecOn.
ko: course-of-values 재귀는 Nat.brecOn로 구현됩니다.

source: The defining equation for div does not hold definitionally, but the equation is available to rewrite and simp.
ko: div 로 방정식을 정의하는 것은 정의로부터 성립하지 않습니다. 그래도 방정식은 rewrite와 simp를 사용할 수 있습니다.

source: The definition is somewhat inscrutable.
ko: 정의는 무언가 헤아리기가 어렵습니다.

source: The definition of double does not have to declare x as an argument; Lean detects the dependence and inserts it automatically.
ko: double의 정의는 x를 인수로서 정의할 필요가 없습니다. 린은 종속성을 감지하고 그것을 자동적으로 삽입합니다.

source: The definition of yellow forms the record with the three values shown, and the projection Color.red returns the red component.
ko: yellow의 정의는 제시한 세 값의 레코드를 형성합니다. 그리고 투영 Color.red은 빨간색 성분을 반환합니다.

source: The definitions and theorems in Lean's standard library are spread across multiple files.
ko: 린의 정의와 정리 표준 라이브러리는 다수의 파일에 걸쳐 펴져있습니다.

source: The definitions of False, True, And, and Or are perfectly analogous to the definitions of Empty, Unit, Prod, and Sum.
ko: False, True, And그리고 Or의 정의는 완전히 Empty, Unit, Prod과 Sum의 정의와 유사합니다.

source: The difference between let and have is that let introduces a local definition in the context, so that the definition of the local declaration can be unfolded in the proof.
ko: let과 have 사이의 차이는 let은 맥락 속에 지역 정의를 도입하여 지역 선언의 정의가 증명속에 접힌채로 될 수 있게 합니다.

source: The difference is that given a : α and h : p a, the term Exists.intro a h has type (∃ x : α, p x) : Prop and Sigma.mk a h has type (Σ x : α, p x) : Type.
ko: 차이점은 a : α와 h : p a에 대해서 항 Exists.intro a h은 e (∃ x : α, p x) : Prop 형을 가지고 Sigma.mk a h는 (Σ x : α, p x) : Type형을 갖는다는 점입니다.

source: The difference is that the first group yields elements of Prop, and the second yields elements of Type u for some u.
ko: 차이점은 첫 번째 그룹은 Prop의 원소를 얻고 두 번째 그룹은 어떤 u에 대한 Type u 의 원소를 얻는다는 점입니다.

source: The difficulty in defining tail is to maintain the relationships between the indices.
ko: tail을 정의하는데 어려움은 인덱스 사이의 관계를 유지해야 한다는 것입니다.

source: The dot notation is convenient not just for accessing the projections of a record, but also for applying functions defined in a namespace with the same name.
ko: 점 기호는 레코드의 투영에 접근하는데에만 편리한 게 아니라 같은 이름인 이름공간에 정의된 함수를 적용하는데에도 편리합니다.

source: The elimination principle generated by Lean is as follows:
ko: 린에 의해 생성된 제거 원리는 다음과 같습니다.

source: The elimination principle, Weekday.rec, is defined along with the type Weekday and its constructors.
ko: 제거 규칙 Weekday.rec은 Weekday형과 그것의 생성자를 따라 정의되었습니다.

source: The elimination rule states:
ko: 제거 규칙은 이와 같이 말합니다.

source: The equation compiler generates such theorems internally.
ko: 방정식 컴파일러는 그런 정리를 내부적으로 생성합니다.

source: The equation compiler in and of itself is not clever enough to derive that x - y is less than x under the given hypotheses, but we can help it out by putting this fact in the local context.
ko: 방정식 컴파일러의 속과 그 자체는 주어진 가정 하에서 x -y가 x보다 작다는 것을 유도할만큼 영리하지 않습니다. 그러나 우리는 그것을 지역 맥락에 이 사실을 넣음으로써 도울 수 있습니다.

source: The equation compiler looks in the local context for such information, and, when it finds it, puts it to good use.
ko: 방정식 컴파일러는 그런 정보에 대해 지역 맥락에서 보고 그것을 찾을 때 사용하기 좋게 둡니다.

source: The equation compiler tries to ensure that this holds whenever possible, as is the case with straightforward structural induction.
ko: 방정식 컴파일러는 직관적인 구조적 재귀와 같은 한 언제든 이것이 성립함을 보장하려고 시도합니다.

source: The equation compiler can process multiple arguments sequentially.
ko: 이 방정식 컴파일러는 다수의 인수를 순차적으로 처리할 수 있습니다.

source: The equation compiler first splits on cases as to whether the input is zero or of the form succ x.
ko: 방정식 컴파일러는 우선 입력이 zero인지 succ x의 꼴인지에 따라 경우를 나눕니다.

source: The equation compiler is clever.
ko: 방정식 컴파일러는 영리합니다.

source: The equation compiler is designed to make definitions like this more convenient.
ko: 방정식 컴파일러는 이 같은 정의를 만드는 데 더 편리하도록 설계되었습니다.

source: The equations used to define these function hold definitionally:
ko: 방정식들은 정의상으로 성립하는 이 함수들을 정의하는데 사용됩니다.

source: The example above demonstrates how type classes are used to overload notation.
ko: 위의 예제는 어떻게 유형 클래스가 기호를 중복(overload)시키는데 사용되는지 시연합니다.

source: The example above shows that Nat.add 3 has type Nat → Nat, that is, Nat.add 3 returns a function that "waits" for a second argument, n, which is then equivalent to writing Nat.add 3 n.
ko: 위의 예제에서 Nat.add 3는 Nat → Nat유형을 가짐을 보였습니다. 즉 Nat.add 3은 두번째 인자 n을 "기다리는" 함수를 반환하는 것입니다. 이것은 Nat.add 3 n로 쓰는 것과 동등합니다.

source: The example above shows that the defining equations for add hold definitionally, and the same is true of mul.
ko: 위 예제에서 add에 대해 정의한 방정식은 정의로부터 성립함을 보여줍니다. 그리고 mul에서 같은 방식으로 참이 됨을 보입니다.

source: The existential elimination rule, Exists.elim, performs the opposite operation.
ko: 존재 한정기호 제거 규칙 Exists.elim은 정반대 연산을 수행합니다.

source: The expression fun x : Nat => x denotes the identity function on Nat, the expression fun x : Nat => true denotes the constant function that always returns true, and fun x : Nat => g (f x) denotes the composition of f and g.
ko: 표현식 fun x : Nat => x은 Nat에 대한 항등함수를 의미합니다. 표현식 fun x : Nat => true은 항상 true을 반환하는 상수함수를 가리합니다. 그리고 fun x : Nat => g (f x)는 f와 g의 합성함수를 가리킵니다.

source: The expression And.intro h1 h2 builds a proof of p ∧ q using proofs h1 : p and h2 : q.
ko: 표현식 And.intro h1 h2은 p ∧ q의 증명을 h1 : p과 h2 : q의 증명을 사용하여 만듭니다.

source: The expression And.left h creates a proof of p from a proof h : p ∧ q.
ko: 표현식 And.left h는 h : p ∧ q의 증명으로부터 p의 증명을 만듭니다.

source: The expression Iff.intro h1 h2 produces a proof of p ↔ q from h1 : p → q and h2 : q → p.
ko: 표현식 Iff.intro h1 h2은 h1 : p → q과 h2 : q → p으로부터 p ↔ q의 증명을 생성합니다.

source: The expression Or.intro_left q hp creates a proof of p ∨ q from a proof hp : p.
ko: 표현식 Or.intro_left q hp은 hp : p의 증명으로부터 p ∨ q의 증명을 만듭니다.

source: The expression decide p tries to infer a decision procedure for p, and, if it is successful, evaluates to either true or false.
ko: 표현식 decide p는 p에 대한 결정 절차를 추론하려고 하고, 성공하면 true나 false 로 평가됩니다.

source: The expression let a := t1; t2 is definitionally equal to the result of replacing every occurrence of a in t2 by t1.
ko: 표현식 let a := t1; t2 는 t2 속 a의 모든 나타남(occurrence)을 t1으로 대체한 결과에 대해 정의상으로 같습니다.

source: The expression Iff.mp h produces a proof of p → q from h : p ↔ q.
ko: 표현식 Iff.mp h는 h : p ↔ q으로부터 p → q의 증명을 생성합니다.

source: The expression p.add q is therefore shorthand for Point.add p q in the example below.
ko: 표현식 p.add q는 그러므로 아래 예제에서 Point.add p q에 대한 축약 표현입니다.

source: The fact that the rules for implication in a proof system for natural deduction correspond exactly to the rules governing abstraction and application for functions is an instance of the Curry-Howard isomorphism, sometimes known as the propositions-as-types paradigm.
ko: 자연 추론을 위한 증명 보조기에서 함의에 대한 규칙이 함수 추상화와 함수 적용을 지배하는 규칙과 정확히 일치한다는 사실은 커리-하워드 동형론(Curry-Howard isomorphism) 의 한 예이며, 때때로 유형으로써 명제(propositions-as-types) 패러다임으로 알려져 있습니다.

source: The first character | in an inductive declaration is optional.
ko: 유도 선언에서 첫 문자 |은 선택적입니다.

source: The first element, h, is commonly known as the "head" of the list, and the remainder, t, is known as the "tail."
ko: 첫 원소 h는 흔히 리스트의 "헤드"로 알려져 있고 나머지 t는 "테일"이라고 알려져 있습니다.

source: The first function returns a type γ so that is also the return type of the compose function.
ko: 첫 번째 함수는 유형 γ 를 반환하여 이게 compose 함수의 반환형이 되게 합니다.

source: The first goal is met with the command exact hp.
ko: 첫 번째 목표는 exact hp명령으로 달성할 수 있습니다.

source: The first instance of the tactic adds h' : succ m = succ n to the context, and the second adds h'' : m = n.
ko: 전략의 첫번째 개체는 h' : succ m = succ n을 맥락에 추가합니다. 그리고 두번째 개체 h'' : m = n을 추가합니다.

source: The first is to run it from the web: a Javascript version of Lean, a standard library of definitions and theorems, and an editor are actually downloaded to your browser and run there.
ko: 첫째는 웹으로부터 이것을 실행하는 것입니다.(Lean의 자바스크립트 버전, 정의와 정리들의 표준 라이브러리, 편집자는 실제로 여러분의 브라우저에 다운로드를 시키고 거기서 실행하는 것임)

source: The first is used to construct a pair, whereas the next two, Prod.fst and Prod.snd, project the two elements.
ko: 첫 째는 쌍을 구성하는데 사용되며 반면 다음 둘은Prod.fst과 Prod.snd은 두 원소를 투영(project)합니다.

source: The first one is the homogeneous multiplication for natural numbers.
ko: 처음 것은 자연수에 대한 동형 곱셈입니다.

source: The first step, rw [Nat.add_zero] at h, rewrites the hypothesis a + 0 = 0 to a = 0.
ko: 첫 단계는 rw [Nat.add_zero] at h는 가정 a + 0 = 0을 a = 0으로 다시 씁니다.

source: The first tactic in the by block below repeatedly splits conjunctions:
ko: by 블럭 아래에 첫 번째 전략은 반복적으로 결합자를 나눕니다.

source: The first version of this book was written for Lean 2, and the Lean 3 version is is available here.
ko: 이 책의 첫 번째 버전은 Lean 2을 위해 쓰였습니다. Lean 3 버전도 여기서 이용 가능합니다.

source: The first, Acc, is an inductively defined predicate.
ko: 우선 Acc은 귀납적으로 정의된 술어입니다.

source: The following calls a given function twice passing the output of the first invocation to the second:
ko: 다음은 주어진 함수를 첫번째 호출의 출력을 두번째에 전달하는 것으로 두 번 호출합니다.

source: The following code block shows the current target after each line.
ko: 다음 코드 블록은 각 줄 뒤에 있는 현재 대상을 보여줍니다.

source: The following command produces the error "failed to create type class instance for Inhabited (Nat × ?m.1499)" because the type has a missing part (i.e., the _).
ko: 다음 명령은 "Inhabited (Nat × ?m.1499)에 대한 유형 클래스 개체를 생성하는데 실패했다(failed to create type class instance for Inhabited (Nat × ?m.1499))"는 오류를 일으킵니다. 왜냐하면 유형에 모르는 부분(즉, _)이 있기 때문입니다.

source: The following definition
ko: 다음 정의

source: The following example defines the tail function using pattern matching.
ko: 다음 예제는 패턴 매칭을 사용해 tail 함수를 정의합니다.

source: The following example defines the prefix relation on lists, proves that this relation is reflexive, and assigns the [simp] attribute to that theorem.
ko: 다음 예제에서는 리스트에 대한 접두사 관계를 정의하고, 이 관계는 반사적임을 증명하고, 그 정리에 [simp] 특성을 부여합니다.

source: The following example demonstrates both approaches.
ko: 다음 예제는 두 접근법을 보여줍니다.

source: The following example illustrates how this is done:
ko: 다음 예제는 이것이 어떻게 이뤄지는지 보여줍니다.

source: The following example is similar: it converts any natural number to a binary expression, represented as a list of 0's and 1's.
ko: 다음 예제는 이것이 어떤 자연수를 이진 표현식으로 바꾸고 0과 1의 리스트로 나타낸다는 점에서 비슷합니다.

source: The following example uses the intros command to introduce the three variables and two hypotheses automatically:
ko: 다음 예제는 intros 명령을 사용해 세 개의 변수와 두 개의 가정을 자동으로 도입합니다.

source: The following example, we declare an inductive type that defines the property of "being in the image of f".
ko: 다음 예제에서 우리는 "f의 이미지에 있음" 속성을 정의하는 귀납형을 선언합니다.

source: The following is a more natural example:
ko: 다음은 더 자연스러운 예제입니다.

source: The following is a shorter version of the preceding proof:
ko: 다음은 이전의 증명보다 더 짧은 버전의 증명입니다.

source: The following is a somewhat toy example:
ko: 다음은 약간 간단한 예제입니다.

source: The following is a structured version of our first tactic proof in this chapter.
ko: 다음은 이 장의 첫번째 우리의 전략 증명의 구조화된 버전입니다.

source: The following list includes a number of common identities.
ko: 다음 리스트는 흔히 사용되는 항등식들을 포함합니다.

source: The following options take an input of true or false:
ko: 다음 옵션은 입력으로 참 혹은 거짓을 받습니다.

source: The following yields the same result:
ko: 다음은 같은 결과를 만듭니다.

source: The full list of axioms that are used in Lean to support classical reasoning are discussed in Axioms and Computations.
ko: 고전 추론을 지원하기 위해 린에서 사용된 모든 공리의 리스트는 공리와 계산에서 다뤄집니다.

source: The function WellFounded.fix is another tool Lean uses to justify that a function terminates.
ko: 함수 WellFounded.fix은 린이 함수 종료를 정당화하는데 사용하는 또 다른 도구입니다.

source: The function fst takes a pair, p.
ko: fst 함수는 쌍 p를 받습니다.

source: The function Prod is similarly polymorphic:
ko: 마찬가지로 Prod 함수는 다형적입니다.

source: The function prod_example takes a pair consisting of a boolean, b, and a number, n, and returns either 2 * n or 2 * n + 1 according to whether b is true or false.
ko: 함수 prod_example은 불리언형 b과 자연수형 n을 받고 2 * n나 2 * n + 1 둘 중의 하나를 b 가 참인지 거짓인지에 따라 출력하는 함수입니다.

source: The functions f and g above denote the same function.
ko: 위 함수 f와 g는 같은 함수를 지칭합니다.

source: The functions prod.fst and prod.snd, which return the first and second elements of a pair, are examples of such projections.
ko: 순서쌍의 첫 번째와 두 번째 원소를 반환하는 함수 prod.fst와 prod.snd는 그런 투영의 예입니다.

source: The general form is as follows:
ko: 일반적인 형태는 다음과 같습니다.

source: The general form of a definition is def foo : α := bar where α is the type returned from the expression bar.
ko: 정의의 일반적인 형태는 def foo : α := bar입니다. 여기서 α 는 식 bar로부터 반환되는 유형입니다.

source: The general form of a lambda expression is fun x : α => t, where the variable x is a "bound variable": it is really a placeholder, whose "scope" does not extend beyond the expression t.
ko: 람다 표현식의 일반적인 형태는 fun x : α => t입니다. 여기서 변수 x는 "구속변수"입니다. 이는 그것의 "범위"가 표현식 t 안으로 제한되는 '자리차지자'일 뿐 입니다.

source: The goal is to support both mathematical reasoning and reasoning about complex systems, and to verify claims in both domains.
ko: 목표는 수학적 추론과 복잡한 시스템에 대한 추론을 모두 지원하고 양쪽 영역의 주장을 식별하게 만드는 겁이다.

source: The goal of Lean's front end is to interpret user input, construct formal expressions, and check that they are well formed and type correct.
ko: 린의 프론트 엔드의 목표는 사용자의 입력을 해석하고 형식적인 표현을 만들고 그들이 잘 형성되었고 옳바른 유형인지 확인하는 것입니다.

source: The gold standard for supporting a mathematical claim is to provide a proof, and twentieth-century developments in logic show most if not all conventional proof methods can be reduced to a small set of axioms and rules in any of a number of foundational systems.
ko: 수학 진술을 지지하기 위한 황금률은 증명을 제공하는 것이며 20세기 논리학의 발전은 기존은 몇 가지의 공리의 모임과 기초계의 몇 가지 규칙으로 축소될 수 있음을 거의 보여주었습니다.

source: The hypothesis e : m = n + 1 in tailAux is used to communicate the relationship between n and the index associated with the minor premise.
ko: tailAux의 가정 e : m = n + 1은 n과 작은 전제와 연관된 인덱스 사이의 관계를 소통하는데 사용됩니다.

source: The idea is that var n is a variable, vₙ, and const n is the constant whose value is n.
ko: 이해를 돕자면 var n는 변수, vₙ와 const n은 값이 n인 상수이다.

source: The idea is that they are structurally smaller, and hence appear in the inductive type at an earlier stage.
ko: 아이디어는 이들이 구조적으로 더 작고 그러므로 앞 단에서 귀납형으로 나타날 수 있다는 것입니다.

source: The idea is that we can define two (or more) inductive types at the same time, where each one refers to the other(s).
ko: 아이디어는 각각이 서로 다른 이들을 참조하면서 우리가 둘(혹은 그 이상의) 귀납형을 동시에 정의할 수 있다는 것입니다.

source: The idea is that we can prove r from p ∨ q, by showing that r follows from p and that r follows from q.
ko: r이 p로부터 나오고 r이 q로부터 나온다는 것을 보임으로써 우리가 p ∨ q로부터 r을 증명할 수 있다는 생각입니다.

source: The idea is as follows.
ko: 아이디어는 다음과 같습니다.

source: The idea is to return some a for the provided patterns, and use none for the incomplete cases.
ko: 이 아이디어는 제공받은 패턴에 대해 some a를 반환하는 것입니다. 그리고 불완전한 경우에 대해 none을 사용합니다.

source: The implicit argument, motive, is the codomain of the function being defined.
ko: 암시적 인수 motive는 정의될 함수와 공동 영역입니다.

source: The impredicativity of Prop means that we can form propositions that quantify over α → Prop.
ko: Prop의 비서술어는 우리가 α → Prop를 한정하는 명제를 세울 수 있음을 의미합니다.

source: The inaccessible pattern .(_) can be written as _ for convenience.
ko: 접근 불가한 패턴 .(_)은 편의상 _로 쓸 수 있습니다.

source: The inductively defined types we have seen so far are "flat": constructors wrap data and insert it into a type, and the corresponding recursor unpacks the data and acts on it.
ko: 우리가 지금까지 본 재귀적으로 정의된 유형은 "평평"합니다. 생성자는 데이터를 변형해서 유형에 그것을 삽입하고, 그에 대응하는 재귀자는 데이터를 풀고 그것에 작용합니다.

source: The inscription .{u} tells Lean to instantiate the constants at the universe u.
ko: 접두사 .{u}은 린에게 세계변수 u로 상수를 개체화하라고 말해줍니다.

source: The instance HMul is not synthesized by Lean because the type of y has not been provided.
ko: y형으로 제공되지 않았으므로 개체 HMul은 린으로부터 생성되지 않습니다.

source: The instance OfNat Nat n is the default instance (with priority 100) for the OfNat class.
ko: 개체 OfNat Nat n은 OfNat 클래스에 대한 (우선순위 100의) 기본 개체입니다.

source: The internally defined function takes, as argument, an element of a sum type, either an input to even, or an input to odd.
ko: 내부적으로 정의된 함수는 인수로써 even의 입력으로나 odd의 입력으로 합 유형의 원소로 받습니다.

source: The internals are meant to be hidden from users; the canonical way to make use of such definitions is to use rewrite or simp, as we did above.
ko: 내부는 사용자로부터 숨겨지도록 의도되었습니다. 그런 정의를 만들어 사용하는 정식 방법은 rewrite나 simp를 우리가 위에서 했던 것처럼 사용하는 것입니다.

source: The interpretation of schematic patterns is the first step of the compilation process.
ko: 도식적인 패턴의 해석은 컴파일 과정의 첫 단계입니다.

source: The introduction and elimination rules we have seen so far are all constructive, which is to say, they reflect a computational understanding of the logical connectives based on the propositions-as-types correspondence.
ko: 지금까지 우리가 본 도입과 제거 규칙은 모두 직관적입니다. 그 말은 그들은 유형으로써 명제 대응에 기반한 논리 연결사의 계산적인 이해를 반영하고 있다는 것입니다.

source: The introduction rule is straightforward: to prove ∃ x : α, p x, it suffices to provide a suitable term t and a proof of p t.
ko: 도입 규칙은 직관적입니다. ∃ x : α, p x을 증명하기 위해 적절한 항 t와 p t의 증명을 제공하는 것으로 충분합니다.

source: The intuition is that an inductive type is exhaustively generated by the constructors, and has no elements beyond those they construct.
ko: 직관적인 설명은 귀납형은 생성자에 의해 철저히 생성된다는 점입니다. 그래서 이들 없이 생긴 원소는 없습니다.

source: The intuition is that each constructor specifies a way of building new objects of Foo, possibly from previously constructed values.
ko: 직관적인 설명은 아마 이전에 구성된 값으로부터 각 생성자가 Foo의 새로운 대상을 만드는 방식을 지정한다는 것입니다.

source: The intuition is that in this case the elimination does not make use of any information that is not already given by the mere fact that the type of argument is inhabited.
ko: 이 경우에 대한 직관적인 설명은 제거가 단순히 인수 유형이 존재한다는 사실에 의해 이미 제공되는 정보를 쓰지 않는다는 것입니다.

source: The judicious use of Unicode improves legibility, and all modern editors have great support for it.
ko: 분별있는 유니코드의 사용은 가독성을 개선합니다. 그리고 현대의 모든 편집기는 그것의 사용을 지원합니다.

source: The last chapter introduced you to methods that construct proofs of statements involving the propositional connectives.
ko: 지난 장에서 여러분에게 명제적 연결사를 포함한 문장의 증명을 구성하는 방법을 소개했습니다.
